Repository: JamesBondMine/RealTimeCommunity
Catalog: RealTimeCommunity_Pro/RealTimeCommunityPro/RealTimeCommunityPro/Global/Language/*.lproj/InfoPlist.strings
Languages: ar, bn, es, fa, fr, hi, pt_br, zh_hans, zh_hant

# CFBundleDisplayName
source: RealTalk
zh_hans: 风铃鸟
zh_hant: 風鈴鳥

# CFBundleName
source: RealTalk
zh_hans: 风铃鸟
zh_hant: 風鈴鳥

# NSCameraUsageDescription
source: We need access to your camera to take photos and videos for sharing with your contacts, video calls, and live streaming features.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول. إذا لم يكن مسموحًا بذلك، فلن تتمكن من استخدام وظائف مثل تسجيل الدخول والتقاط الصور وتسجيل الفيديو بشكل طبيعي.
bn: অ্যাক্সেসের অনুমতি দিতে ওকে ক্লিক করুন। যদি অনুমতি না দেওয়া হয়, আপনি সাধারণত লগইন, ফটো তোলা এবং ভিডিও রেকর্ডিংয়ের মতো ফাংশনগুলি ব্যবহার করতে পারবেন না৷
es: Haga clic en Aceptar para permitir el acceso. Si no está permitido, no podrá utilizar normalmente funciones como iniciar sesión, tomar fotografías y grabar videos.
fa: لطفاً برای اجازه دسترسی، روی تأیید کلیک کنید. اگر مجاز نباشد، نمی توانید به طور معمول از عملکردهایی مانند ورود به سیستم، عکس گرفتن و ضبط ویدیو استفاده کنید.
fr: Veuillez cliquer sur OK pour autoriser l'accès. Si cela n’est pas autorisé, vous ne pourrez pas utiliser normalement des fonctions telles que la connexion, la prise de photos et l’enregistrement vidéo.
hi: पहुंच की अनुमति देने के लिए कृपया ओके पर क्लिक करें। यदि अनुमति नहीं है, तो आप सामान्य रूप से लॉगिन, फोटो लेने और वीडियो रिकॉर्डिंग जैसे कार्यों का उपयोग नहीं कर पाएंगे।
pt_br: Precisamos acessar sua câmera para tirar fotos e vídeos para compartilhar com seus contatos, fazer videochamadas e transmissões ao vivo.
zh_hans: 我们需要访问您的相机以拍摄照片和视频，用于与联系人分享、视频通话和直播功能。
zh_hant: 請點擊'好'以允許訪問。如果不允許將無法正常使用相機進行掃碼登錄、拍攝照片、頭像、錄製視頻，進行視頻通話。

# NSLocationAlwaysUsageDescription
source: We need your location to share your current location with contacts and discover nearby users.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول إلى معلومات موقعك في بطاقة عملك.
bn: আপনার ব্যবসা কার্ডে আপনার অবস্থানের তথ্য অ্যাক্সেস করার অনুমতি দিতে দয়া করে ঠিক আছে ক্লিক করুন৷
es: Haga clic en Aceptar para permitir el acceso a la información de su ubicación en su tarjeta de presentación.
fa: لطفاً روی تأیید کلیک کنید تا به اطلاعات موقعیت مکانی خود در کارت ویزیت خود دسترسی داشته باشید.
fr: Veuillez cliquer sur OK pour autoriser l'accès aux informations de localisation sur votre carte de visite.
hi: कृपया अपने व्यवसाय कार्ड में अपने स्थान की जानकारी तक पहुंच की अनुमति देने के लिए ओके पर क्लिक करें।
pt_br: Precisamos acessar sua localização para compartilhar sua localização atual com contatos e descobrir usuários próximos.
zh_hans: 我们需要访问您的位置信息，以便分享当前位置给联系人和发现附近用户。
zh_hant: 請點擊'好'以允許允許訪問,以便在個人名片中訪問您的位置。

# NSLocationWhenInUseUsageDescription
source: We need your location to share your current location with contacts and discover nearby users.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول إلى معلومات موقعك في بطاقة عملك.
bn: আপনার ব্যবসা কার্ডে আপনার অবস্থানের তথ্য অ্যাক্সেস করার অনুমতি দিতে দয়া করে ঠিক আছে ক্লিক করুন৷
es: Haga clic en Aceptar para permitir el acceso a la información de su ubicación en su tarjeta de presentación.
fa: لطفاً روی تأیید کلیک کنید تا به اطلاعات موقعیت مکانی خود در کارت ویزیت خود دسترسی داشته باشید.
fr: Veuillez cliquer sur OK pour autoriser l'accès aux informations de localisation sur votre carte de visite.
hi: कृपया अपने व्यवसाय कार्ड में अपने स्थान की जानकारी तक पहुंच की अनुमति देने के लिए ओके पर क्लिक करें।
pt_br: Precisamos acessar sua localização para compartilhar sua localização atual com contatos e descobrir usuários próximos.
zh_hans: 我们需要访问您的位置信息，以便分享当前位置给联系人和发现附近用户。
zh_hant: 請點擊'好'以允許允許訪問,以便在個人名片中訪問您的位置。

# NSMicrophoneUsageDescription
source: We need access to your microphone for voice messages, voice calls, video calls, and live streaming features.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول. إذا لم يكن مسموحًا بذلك، فلن تتمكن من استخدام وظيفة الدردشة الصوتية بشكل صحيح.
bn: অ্যাক্সেসের অনুমতি দিতে ওকে ক্লিক করুন। অনুমতি না দিলে, আপনি ভয়েস চ্যাট ফাংশনটি সঠিকভাবে ব্যবহার করতে পারবেন না।
es: Haga clic en Aceptar para permitir el acceso. Si no está permitido, no podrá utilizar la función de chat de voz correctamente.
fa: لطفاً برای اجازه دسترسی، روی تأیید کلیک کنید. اگر مجاز نباشد، نمی توانید از عملکرد چت صوتی به درستی استفاده کنید.
fr: Veuillez cliquer sur OK pour autoriser l'accès. Si cela n'est pas autorisé, vous ne pourrez pas utiliser correctement la fonction de chat vocal.
hi: पहुंच की अनुमति देने के लिए कृपया ओके पर क्लिक करें। यदि अनुमति नहीं है, तो आप वॉइस चैट फ़ंक्शन का ठीक से उपयोग नहीं कर पाएंगे।
pt_br: Precisamos acessar seu microfone para mensagens de voz, chamadas de voz, videochamadas e transmissões ao vivo.
zh_hans: 我们需要访问您的麦克风，以便使用语音消息、语音通话、视频通话和直播功能。
zh_hant: 請點擊'好'以允許訪問。如果不允許，您將無法正常使用語音聊天。

# NSPhotoLibraryUsageDescription
source: We need access to your photo library to select and share photos and videos with your contacts.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول. إذا لم يكن مسموحًا بذلك، فلن تتمكن من استخدام وظائف مثل تسجيل الدخول والتقاط الصور وتسجيل الفيديو بشكل طبيعي.
bn: অ্যাক্সেসের অনুমতি দিতে ওকে ক্লিক করুন। যদি অনুমতি না দেওয়া হয়, আপনি সাধারণত লগইন, ফটো তোলা এবং ভিডিও রেকর্ডিংয়ের মতো ফাংশনগুলি ব্যবহার করতে পারবেন না৷
es: Haga clic en Aceptar para permitir el acceso. Si no está permitido, no podrá utilizar normalmente funciones como iniciar sesión, tomar fotografías y grabar videos.
fa: لطفاً برای اجازه دسترسی، روی تأیید کلیک کنید. اگر مجاز نباشد، نمی توانید به طور معمول از عملکردهایی مانند ورود به سیستم، عکس گرفتن و ضبط ویدیو استفاده کنید.
fr: Veuillez cliquer sur OK pour autoriser l'accès. Si cela n’est pas autorisé, vous ne pourrez pas utiliser normalement des fonctions telles que la connexion, la prise de photos et l’enregistrement vidéo.
hi: पहुंच की अनुमति देने के लिए कृपया ओके पर क्लिक करें। यदि अनुमति नहीं है, तो आप सामान्य रूप से लॉगिन, फोटो लेने और वीडियो रिकॉर्डिंग जैसे कार्यों का उपयोग नहीं कर पाएंगे।
pt_br: Precisamos acessar sua biblioteca de fotos para selecionar e compartilhar fotos e vídeos com seus contatos.
zh_hans: 我们需要访问您的相册，以便选择和分享照片、视频给联系人。
zh_hant: 請點擊「好」以允許存取。如果不允許您將無法選擇照片發送給朋友

# NSPhotoLibraryAddUsageDescription
source: We need permission to save photos and videos to your photo library.
ar: الرجاء النقر فوق 'موافق' للسماح بالوصول. إذا لم يكن ذلك مسموحًا به، فلن تتمكن من حفظ الصور التي تريد تنزيلها في ألبوم الصور الخاص بهاتفك.
bn: অ্যাক্সেসের অনুমতি দিতে ওকে ক্লিক করুন। অনুমতি না থাকলে, আপনি যে ছবিগুলি ডাউনলোড করতে চান তা আপনার ফোনের ফটো অ্যালবামে সংরক্ষণ করতে পারবেন না৷
es: Haga clic en Aceptar para permitir el acceso. Si no está permitido, no podrá guardar las imágenes que desea descargar en el álbum de fotos de su teléfono.
fa: لطفاً برای اجازه دسترسی، روی تأیید کلیک کنید. اگر مجاز نباشد، نمی توانید تصاویری را که می خواهید دانلود کنید در آلبوم عکس گوشی خود ذخیره کنید.
fr: Veuillez cliquer sur OK pour autoriser l'accès. Si cela n'est pas autorisé, vous ne pourrez pas enregistrer les photos que vous souhaitez télécharger dans l'album photo de votre téléphone.
hi: पहुंच की अनुमति देने के लिए कृपया ओके पर क्लिक करें। यदि अनुमति नहीं है, तो आप उन चित्रों को सहेज नहीं पाएंगे जिन्हें आप अपने फोन के फोटो एलबम में डाउनलोड करना चाहते हैं।
pt_br: Precisamos de permissão para salvar fotos e vídeos em sua biblioteca de fotos.
zh_hans: 我们需要权限将照片和视频保存到您的相册。
zh_hant: 請點擊'好'以允許訪問。如果不允許，將無法把您想要下載的圖片保存到手機。

# NSLocalNetworkUsageDescription
source: We need access to the local network for device communication and to provide better services.
ar: انقر فوق 'موافق' للسماح بالوصول إلى الشبكة المحلية للتواصل مع الجهاز.
bn: ডিভাইসের সাথে যোগাযোগ করার জন্য স্থানীয় নেটওয়ার্কে অ্যাক্সেসের অনুমতি দিতে ওকে ক্লিক করুন।
es: Haga clic en Aceptar para permitir el acceso a la red local para comunicarse con el dispositivo.
fa: برای اجازه دسترسی به شبکه محلی برای برقراری ارتباط با دستگاه، روی OK کلیک کنید.
fr: Cliquez sur OK pour autoriser l'accès au réseau local pour communiquer avec l'appareil.
hi: डिवाइस के साथ संचार करने के लिए स्थानीय नेटवर्क तक पहुंच की अनुमति देने के लिए ओके पर क्लिक करें।
pt_br: Precisamos acessar a rede local para comunicação entre dispositivos e fornecer melhores serviços.
zh_hans: 我们需要访问本地网络以便设备间通信和提供更好的服务。
zh_hant: 請點選'好'以允許存取本機網路以便通訊。

# NSContactsUsageDescription
source: We need access to your contacts to help you find friends who are already using the app.
ar: نحتاج إلى الوصول إلى جهات الاتصال الخاصة بك لمساعدتك في العثور على الأصدقاء الذين يستخدمون التطبيق بالفعل.
bn: আমাদের আপনার পরিচিতিগুলিতে অ্যাক্সেসের প্রয়োজন যাতে আপনি ইতিমধ্যে অ্যাপটি ব্যবহার করছেন এমন বন্ধুদের খুঁজে পেতে পারেন।
es: Necesitamos acceso a tus contactos para ayudarte a encontrar amigos que ya están usando la aplicación.
fa: ما نیاز به دسترسی به مخاطبین شما داریم تا به شما کمک کنیم دوستانی را که قبلاً از برنامه استفاده می کنند پیدا کنید.
fr: Nous avons besoin d'accéder à vos contacts pour vous aider à trouver des amis qui utilisent déjà l'application.
hi: हमें आपके संपर्कों तक पहुंच की आवश्यकता है ताकि आप पहले से ऐप का उपयोग कर रहे मित्रों को खोजने में सहायता कर सकें।
pt_br: Precisamos acessar seus contatos para ajudá-lo a encontrar amigos que já estão usando o aplicativo.
zh_hans: 我们需要访问您的通讯录，以帮助您找到已经在使用本应用的好友。
zh_hant: 我們需要訪問您的通訊錄，以幫助您找到已經在使用本應用的好友。

# NSFaceIDUsageDescription
source: We use Face ID to securely authenticate and protect your account.
ar: نستخدم Face ID للمصادقة بشكل آمن وحماية حسابك.
bn: আমরা নিরাপদে প্রমাণীকরণ এবং আপনার অ্যাকাউন্ট সুরক্ষিত করতে Face ID ব্যবহার করি।
es: Usamos Face ID para autenticar de forma segura y proteger tu cuenta.
fa: ما از Face ID برای احراز هویت ایمن و محافظت از حساب شما استفاده می کنیم.
fr: Nous utilisons Face ID pour authentifier en toute sécurité et protéger votre compte.
hi: हम आपके खाते को सुरक्षित रूप से प्रमाणित करने और सुरक्षित रखने के लिए Face ID का उपयोग करते हैं।
pt_br: Usamos o Face ID para autenticar com segurança e proteger sua conta.
zh_hans: 我们使用面容ID来安全地验证身份和保护您的账户。
zh_hant: 我們使用面容ID來安全地驗證身份和保護您的賬戶。

# NSSpeechRecognitionUsageDescription
source: We need access to speech recognition for voice-to-text features in messages.
ar: نحتاج إلى الوصول إلى التعرف على الكلام لميزات الصوت إلى نص في الرسائل.
bn: আমাদের বার্তাগুলিতে ভয়েস-টু-টেক্সট বৈশিষ্ট্যের জন্য বক্তৃতা স্বীকৃতিতে অ্যাক্সেসের প্রয়োজন।
es: Necesitamos acceso al reconocimiento de voz para funciones de voz a texto en mensajes.
fa: ما نیاز به دسترسی به تشخیص گفتار برای ویژگی های صوت به متن در پیام ها داریم.
fr: Nous avons besoin d'accéder à la reconnaissance vocale pour les fonctionnalités de conversion voix en texte dans les messages.
hi: हमें संदेशों में वॉयस-टू-टेक्स्ट सुविधाओं के लिए वाक् पहचान तक पहुंच की आवश्यकता है।
pt_br: Precisamos acessar o reconhecimento de fala para recursos de voz para texto em mensagens.
zh_hans: 我们需要访问语音识别功能，以便在消息中实现语音转文字功能。
zh_hant: 我們需要訪問語音識別功能，以便在消息中實現語音轉文字功能。

# NSCalendarsUsageDescription
source: We need access to your calendar to help you schedule events and meetings.
ar: نحتاج إلى الوصول إلى التقويم الخاص بك لمساعدتك في جدولة الأحداث والاجتماعات.
bn: আমাদের আপনার ক্যালেন্ডারে অ্যাক্সেসের প্রয়োজন যাতে আপনি ইভেন্ট এবং মিটিং সময়সূচী করতে পারেন।
es: Necesitamos acceso a tu calendario para ayudarte a programar eventos y reuniones.
fa: ما نیاز به دسترسی به تقویم شما داریم تا به شما کمک کنیم رویدادها و جلسات را برنامه ریزی کنید.
fr: Nous avons besoin d'accéder à votre calendrier pour vous aider à planifier des événements et des réunions.
hi: हमें आपके कैलेंडर तक पहुंच की आवश्यकता है ताकि आप कार्यक्रमों और बैठकों को शेड्यूल करने में सहायता कर सकें।
pt_br: Precisamos acessar seu calendário para ajudá-lo a agendar eventos e reuniões.
zh_hans: 我们需要访问您的日历，以帮助您安排活动和会议。
zh_hant: 我們需要訪問您的日曆，以幫助您安排活動和會議。

# NSRemindersUsageDescription
source: We need access to your reminders to set notifications for important events.
ar: نحتاج إلى الوصول إلى تذكيراتك لتعيين إشعارات للأحداث المهمة.
bn: আমাদের আপনার অনুস্মারকগুলিতে অ্যাক্সেসের প্রয়োজন যাতে গুরুত্বপূর্ণ ইভেন্টগুলির জন্য বিজ্ঞপ্তি সেট করতে পারি।
es: Necesitamos acceso a tus recordatorios para establecer notificaciones para eventos importantes.
fa: ما نیاز به دسترسی به یادآوری های شما داریم تا اعلان ها را برای رویدادهای مهم تنظیم کنیم.
fr: Nous avons besoin d'accéder à vos rappels pour définir des notifications pour les événements importants.
hi: हमें आपके अनुस्मारकों तक पहुंच की आवश्यकता है ताकि महत्वपूर्ण घटनाओं के लिए सूचनाएं सेट की जा सकें।
pt_br: Precisamos acessar seus lembretes para definir notificações para eventos importantes.
zh_hans: 我们需要访问您的提醒事项，以便为重要事件设置通知。
zh_hant: 我們需要訪問您的提醒事項，以便為重要事件設置通知。
